; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v1 - type_2 ?v7 - type_3)
 	      (pred_2 ?v3 - object ?v7 - type_3)
	      (pred_1 ?v1 - type_2 ?v4 - type_1)
	      (pred_3 ?v1 - type_2 ?v3 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v1 - type_2 ?v6 ?v2 - type_3)
       :precondition (and  (pred_4 ?v1 ?v6))
       :effect (and  (pred_4 ?v1 ?v2)
		     (not (pred_4 ?v1 ?v6))))

   (:action op_2
       :parameters (?v1 - type_2 ?v8 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v8 ?v5) (pred_4 ?v1 ?v5) (pred_1 ?v1 ?v4))
       :effect (and (pred_3 ?v1 ?v8 ?v4)
		    (not (pred_2 ?v8 ?v5)) 
		    (not (pred_1 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_2 ?v8 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v8 ?v4) (pred_4 ?v1 ?v5))
       :effect (and (pred_2 ?v8 ?v5)
		    (pred_1 ?v1 ?v4)
		    (not (pred_3 ?v1 ?v8 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_09 - type_2
obj_06 obj_01 - type_1
obj_02 obj_07 obj_04 obj_05 - type_3
obj_10 obj_03 obj_08 - object)
(:init
(pred_4 obj_09 obj_02)
(pred_1 obj_09 obj_06)
(pred_1 obj_09 obj_01)
(pred_2 obj_10 obj_07)
(pred_2 obj_03 obj_07)
(pred_2 obj_08 obj_07)
)
(:goal
(and
(pred_2 obj_10 obj_04)
(pred_2 obj_03 obj_07)
(pred_2 obj_08 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_09 ?b obj_01))))
)
)

; plan
1. (op_3 obj_09 obj_02 obj_07)
   deleted: (pred_4 obj_09 obj_02)
   added: (pred_4 obj_09 obj_07)
   goals met: 1 of 3
2. (op_2 obj_09 obj_10 obj_07 obj_06)
   deleted: (pred_2 obj_10 obj_07) (pred_1 obj_09 obj_06)
   added: (pred_3 obj_09 obj_10 obj_06)
   goals met: 1 of 3
3. (op_3 obj_09 obj_07 obj_04)
   deleted: (pred_4 obj_09 obj_07)
   added: (pred_4 obj_09 obj_04)
   goals met: 1 of 3
4. (op_1 obj_09 obj_10 obj_04 obj_06)
   deleted: (pred_3 obj_09 obj_10 obj_06)
   added: (pred_2 obj_10 obj_04) (pred_1 obj_09 obj_06)
   goals met: 2 of 3
5. (op_3 obj_09 obj_04 obj_07)
   deleted: (pred_4 obj_09 obj_04)
   added: (pred_4 obj_09 obj_07)
   goals met: 2 of 3
6. (op_2 obj_09 obj_08 obj_07 obj_06)
   deleted: (pred_2 obj_08 obj_07) (pred_1 obj_09 obj_06)
   added: (pred_3 obj_09 obj_08 obj_06)
   goals met: 2 of 3
7. (op_3 obj_09 obj_07 obj_04)
   deleted: (pred_4 obj_09 obj_07)
   added: (pred_4 obj_09 obj_04)
   goals met: 2 of 3
8. (op_1 obj_09 obj_08 obj_04 obj_06)
   deleted: (pred_3 obj_09 obj_08 obj_06)
   added: (pred_2 obj_08 obj_04) (pred_1 obj_09 obj_06)
   goals met: 3 of 3
